/**
 * **********************************************************************************
 * @copyright Copyright (c) 2023 Shaanxi Tianji Communication Technologies Co., Ltd.
 *                         
 * @file        wwdg.c   
 * @author      WangJun
 * @version     None
 * @date        2023-09-05     
 * @brief       None   
 * 
 * **********************************************************************************
 */

#include "wwdg.h"


/*---------------------- 端口定义 ----------------------*/


/*---------------------- 宏 定 义 ----------------------*/


/*---------------------- 结 构 体 ----------------------*/


/*---------------------- 常    量 ----------------------*/


/*---------------------- 全局变量 ----------------------*/


/*---------------------- 局部变量 ----------------------*/


/*---------------------- 函    数 ----------------------*/
/*****************************************************************************
* @brief  : 窗口看门狗初始化
* @param  : None
* @retval : None
* @date   : 2023-09-05
* @note   :
*****************************************************************************/
void wwgd_init(void)
{
    /* enable WWDGT clock */
    rcu_periph_clock_enable(RCU_WWDGT);

    /*
     *  System clock up to 200Mhz, PCLK1=50MHz
     *  set WWDGT clock = (PCLK1 (50MHz)/4096)/8 = 1528Hz (~654 us)
     *  set counter value to 0x7D
     *  set window value to 0x50
     *  refresh window is: ~654 * (0x7D - 0x50)= 29.3ms < refresh window < ~654 * (0x7D - 0x3F) =40.5ms.
     */
    wwdgt_config(0x7D, 0x50, WWDGT_CFG_PSC_DIV8);

    wwdgt_enable();
}


/*****************************************************************************
* @brief  : 喂狗
* @param  : None
* @retval : 
* @date   : 2023-09-05
* @note   : 
*****************************************************************************/
void wwdg_feed(void)
{
    /* update WWDGT counter */
    wwdgt_counter_update(0x7D);
}


/*****************************************************************************
* @brief  : 冻结wwdg
* @param  : None
* @retval : 
* @date   : 2023-09-05
* @note   : 测试有问题，不使用
*****************************************************************************/
void wwdg_dbg_stop(void)
{
    dbg_periph_enable(DBG_WWDGT_HOLD);
}
