/**
 * **********************************************************************************
 * @copyright Copyright (c) 2023 Shaanxi Tianji Communication Technologies Co., Ltd.
 *
 * @file        hi_delay.c
 * @author      WangJun
 * @version     None
 * @date        2023-12-5
 * @brief       None
 *
 * **********************************************************************************
 */

#include "hi_delay.h"

/*---------------------- 端口定义 --------------------------------------*/


/*---------------------- 宏定义  ---------------------------------------*/


/*---------------------- 结构体 ----------------------------------------*/


/*---------------------- 常量 ------------------------------------------*/


/*---------------------- 全局变量 --------------------------------------*/
/**
  * 主频200MHz,采样时钟400MHz,采样精度2.5ns
  * -o0：1.015us
  */
#if(PRODUCT_MODEL == CMDT3521A)
    #define DELAY_NOPS_0p1US (23)

#elif(PRODUCT_MODEL == CMDT3521B)
    #define DELAY_NOPS_0p1US (23)

#elif(PRODUCT_MODEL == CMDT3521C)
    #define DELAY_NOPS_0p1US (23)
     
#elif(PRODUCT_MODEL == CMDT3521D)

#elif(PRODUCT_MODEL == CMDT3521E)

#elif(PRODUCT_MODEL == CMDT3521F)

#endif
/*---------------------- 局部变量 --------------------------------------*/


/*---------------------- 声明 ------------------------------------------*/


/*****************************************************************************
* @brief  : 延迟
* @param  : num: 延时个数
* @retval : None
* @date   : 2023-09-11
* @note   : 
*****************************************************************************/
static void hi_delay_nop(uint16_t num)
{
    uint16_t index = 0;
    for(index = 0; index < num; index++)
    {
        __NOP();
    }
}

/*****************************************************************************
* @Name	  : hi_delay_us
* @brief  : 延时n us
* @param  : us ：单位us
* @author :
* @Data   :
* @Note   :
*****************************************************************************/
void hi_delay_us(uint32_t us)
{
    hi_delay_nop(us * DELAY_NOPS_0p1US);
}
