/***************************** Copyright ****************************************
*
* (C) Copyright 2023, Shaanxi Tianji Communication
*  All Rights Reserved
*
* FileName   : bsp_rf_dc_switch.c
* Version    : none
* Author     :
* Date       : 2023-11-16
* Description: none
*******************************************************************************/
#include "main.h"
//#include "stdlib.h"
//#include "stdio.h"
//#include "string.h"
#include "system_config.h"
#include "bsp_rf_dc_switch.h"
#include "bsp_rf_global.h"
#include "bsp_config.h"

#include "bsp_rf_4g_band_sel.h"

/*---------------------- 端口定义 --------------------------------------*/


/*---------------------- 宏定义  ---------------------------------------*/


/*---------------------- 结构体 ----------------------------------------*/


/*---------------------- 常量 ------------------------------------------*/


/*---------------------- 全局变量 --------------------------------------*/


/*---------------------- 局部变量 --------------------------------------*/


/*---------------------- 声明 ------------------------------------------*/



/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ HAL ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/





/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ DRV ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/





/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ APP ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/

/*****************************************************************************
* @brief  : b3-b8-b30-b40通道开关全部关闭
* @param  : None
* @retval : 
* @date   : 2023-12-30
* @note   : 
*****************************************************************************/
static void rf_4g_dc_all_close(void)
{
    BI_PORT_CTL(&rf_b3_dc_ctrl, PORT_ON);   // 高电平关闭
    BI_PORT_CTL(&rf_b8_dc_ctrl, PORT_ON);
    BI_PORT_CTL(&rf_b39_dc_ctrl, PORT_ON);
    BI_PORT_CTL(&rf_b40_dc_ctrl, PORT_ON);
}


/*****************************************************************************
* @Name	  : rf_dc_set
* @Brief  : 通道电源开关控制
* @Param  : sys: [输入/出]
**			 ch: [输入/出]
**			 state: OPEN / CLOSE
* @Retval :
* @Author :
* @Data   : 2023-11-16
* @Note   :
*****************************************************************************/
void rf_dc_set(uint8_t sys, PORT_CTL_E state)
{
    if(sys >= RF_SYS_NUM)
        return;

    if((state != PORT_ON) && (state != PORT_OFF))
        return;
    
    switch(sys)
    {
        case RF_SYS_1:
            rf_4g_dc_all_close();   // 进入之后先全部关闭
        
            BI_PORT_CTL(&rf_4g_dc_en, state);
            BI_PORT_CTL(pt_4g_dc_ctrl, (PORT_CTL_E)(!state));
            break;

        case RF_SYS_2:
            BI_PORT_CTL(&rf_nr_dc_en, state);
            break;

        case RF_SYS_3:
            BI_PORT_CTL(&rf_mimo_dc_en, state);
            break;

        default:
            break;
    }
}

