/**
 * **********************************************************************************
 * @copyright Copyright (c) 2023 Shaanxi Tianji Communication Technologies Co., Ltd.
 *                         
 * @file        app_config.h   
 * @author      
 * @version     None
 * @date        2023-12-04     
 * @brief       None   
 * 
 * **********************************************************************************
 */

#ifndef __APP_CONFIG_H_
#define __APP_CONFIG_H_

#include "bsp_config.h"

#ifdef __cplusplus
 extern "C" {
#endif


/****************************** 调试 ******************************/


/****************************** 监控 ******************************/


/****************************** 射频通道 **************************/


/****************************** 功能开关 **************************/



#ifdef __cplusplus
}
#endif

#endif
