/**
 * **********************************************************************************
 * @copyright Copyright (c) 2023 Shaanxi Tianji Communication Technologies Co., Ltd.
 *
 * @file        hi_irq.c
 * @author      WangJun
 * @version     None
 * @date        2023-11-6
 * @brief       None
 *
 * **********************************************************************************
 */
 
#include "hi_irq.h"

/*---------------------- 端口定义 --------------------------------------*/


/*---------------------- 宏定义  ---------------------------------------*/


/*---------------------- 结构体 ----------------------------------------*/


/*---------------------- 常量 ------------------------------------------*/


/*---------------------- 全局变量 --------------------------------------*/


/*---------------------- 局部变量 --------------------------------------*/


/*---------------------- 声明 ------------------------------------------*/




/*****************************************************************************
* @Name	  : hi_irq_on
* @Brief  : 使能中断
* @param  : irq 中断
* @param  : priority 优先级,仅主优先级,次优先级默认为0
* @Author :
* @Data   :
* @Note   :

*****************************************************************************/
void hi_irq_on(IRQ_T irq, uint8_t priority)
{
#if(MCU_SERIES == MCU_GD32F4XX)
    nvic_irq_enable(irq, priority, 0);
#elif(MCU_SERIES == MCU_STM32F4XX || MCU_SERIES == MCU_STM32H5XX)
    HAL_NVIC_EnableIRQ(irq);
#endif

}

/*****************************************************************************
* @Name	  : hiGpioWrite
* @brief  : 失能中断
* @param  :
* @retval : None
* @author :
* @Data   :
* @Note   :
* @Note   :
*****************************************************************************/
void hi_irq_off(IRQ_T irq)
{
#if(MCU_SERIES == MCU_GD32F4XX)
    nvic_irq_disable(irq);
#elif(MCU_SERIES == MCU_STM32F4XX || MCU_SERIES == MCU_STM32H5XX)
    HAL_NVIC_DisableIRQ(irq);
#endif

}
