/*************************************** Copyright ******************************
*
* (C) Copyright 2023, Shaanxi Tianji Communication
* All Rights Reserved
*                         
* FileName   : hi_iwdg.h   
* Version    : none		
* Author     : 			
* Date       : 2023-05-26         
* Description: iwdg的通用操作接口，支持多型号MCU，MCU列表请看MCU_config.h
    
*******************************************************************************/
//
#ifndef __HI_IWDG_H__
#define __HI_IWDG_H__

#include "iwdg.h"
#include "MCU_config.h"

/*---------------------- 端口定义 --------------------------------------*/
#if(MCU_SERIES == MCU_GD32F4XX)

#elif(MCU_SERIES == MCU_STM32F4XX || MCU_SERIES == MCU_STM32H5XX)

#endif
/*---------------------- 宏定义  ---------------------------------------*/


/*---------------------- 声明 ------------------------------------------*/


/*****************************************************************************
* @Name	  : hi_iwdg_init
* @brief  : 看门狗初始化
* @author :
* @Data   :
* @Note   :
*****************************************************************************/
void hi_iwdg_init(void);

/*****************************************************************************
* @Name	  : hi_iwdg_feed
* @brief  : 喂狗
* @author : 
* @Data   : 
* @Note   :
*****************************************************************************/
void hi_iwdg_feed(void);





#endif
